import { CommonModule } from '@angular/common';
import { Component } from '@angular/core';

@Component({
  selector: 'app-news',
  standalone: false,
  templateUrl: './news.html',
  styleUrl: './news.css',
})
export class News {
  News = [
    {
      image: 'assets/News/SweetPulsePlay.png',
      Heading: 'مسرحية (نبض حلم) بمهرجان آفاق الدولي',
      Summary: `
شهد مسرح آفاق اليوم تقديم العرض الأول لمسرحية (نبض حلم) ضمن فعاليات مهرجان آفاق الدولي،          
              وسط حضور مميز من المهتمين بالشأن الثقافي والفني، وعدد من الشخصيات العامة والإعلاميين.
وقد قدم العرض رسالة إنسانية قوية من خلال البطلتين فاطمة وسُجى، اللتين جسّدتا تجربة تعكس الإرادة والطموح وتحدّي الصعاب،           
والبطلة المتألقة / نسرين نصيف، في عمل فني يسلط الضوء على قصص ملهمة من واقع الحياة.                
العرض من إخراج عادل أمين، وبمشاركة فريق عمل ضم:               
حسن عبد العزيز – هشام بلال – حمادة التنجيري – عمر نخلة – يحيى محمود،              
الذين بذلوا مجهودا كبيرا ظهر بوضوح في مستوى العرض وتنظيمه.              
كما شهد الحدث حضور عدد من الداعمين والشخصيات التي حرصت على مساندة التجربة وإبراز رسالتها المجتمعية.             
`,
      Date: '15/11/2025'
    },
    {
      image: 'assets/News/Meeting.png',
      Heading: ' لقاء مع أهالي منطقة فيصل والحرفيين',
      Summary: `
ضمن سلسلة اللقاءات الميدانية ، شارك الأستاذ/ أحمد غريب حسين – مرشح حزب الجبهة الوطنية عن المقعد الفردي (رقم 2 – رمز السيارة 🚗) 
في لقاء  مع أهالي منطقة فيصل والحرفيين.
لتبادل الحوار حول أهم القضايا والاحتياجات في الشارع 
السويسي، في أجواء مليئة بالحماس والدعم لمرشحهم القادر على تمثيلهم بأمانة.            
`,
      Date: '11/11/2025'
    },
    {
      image: 'assets/News/News3.png',
      Heading: ' تفاصيل انتخابات مجلس النواب 2025',
      Summary:  `إعلان النتيجة الرسمية                             جولة الإعادة                                                  بدء الصمت الانتخابي    
سيتم إعلان النتيجة النهائية،                      في الخارج: ١٥ و ١٦ ديسمبر ٢٠٢٥                             يبدأ الصمت الانتخابي اعتبارًا           
متضمنة أصوات المصريين في الخارج،                 في الداخل: ١٧ و ١٨ ديسمبر ٢٠٢٥                               من ١٤ ديسمبر ٢٠٢٥                      
 يوم ٢ ديسمبر ٢٠٢٥.

أصوات المرشحين في انتخابات السويس — نوفمبر ٢٠٢٥
أحمد غريب: ١٥٠٤٠    أحمد خشانه: ٧٩٢٢    محمد فاروق: ٧٢٤٠    طارق متولي: ٦١٢٨    طلعت خليل: ٣٨١٤    حمادة ناصر: ٢٨٥٩
عماد خاطر: ٢٧٤٧      عادل فاضل: ٢٣٨٣      ثناء الفحام: ١٣٦٩      محمد القلعاوي: ١١٩٩    عمر الباشا: ٩٦٢       علي عبدالعال: ٦٩٤
سيد الحوت: ٣٣٧       أحمد الصبيح: ٩٧٨       باسم النجار: ٤٩٦       مصطفى محمد: ٣٣٢     كريم العسكري: ٤٣٥      محمد مصطفى عبدالعزيز: ٧٢٣
`,
      Date: '11/11/2025'
    },

 {
      image: 'assets/News/Result.jpg',
      Heading: 'نتيجة انتخابات الجولة الاولى بمقعد مجلس النواب',
      Summary: `احتفال المواطنين مع النائب احمد غريب حسين امين حزب الجبهة الوطنية بالسويس عقب اعلان النتيجة من الهيئة العليا للانتخابات بفوزه من الجولة الاولى بمقعد مجلس النواب
`,
      Date: '2/12/2025'
    }
  ];

}
