import { CommonModule } from '@angular/common';
import { Component } from '@angular/core';

@Component({
  selector: 'app-news',
  standalone: false,
  templateUrl: './news.html',
  styleUrl: './news.css',
})
export class News {
  News = [
    {
      image: 'assets/News/SweetPulsePlay.png',
      Heading: 'مسرحية (نبض حلم) بمهرجان آفاق الدولي',
      Summary: `
شهد مسرح آفاق اليوم تقديم العرض الأول لمسرحية (نبض حلم) ضمن فعاليات مهرجان آفاق الدولي،          
              وسط حضور مميز من المهتمين بالشأن الثقافي والفني، وعدد من الشخصيات العامة والإعلاميين.
وقد قدم العرض رسالة إنسانية قوية من خلال البطلتين فاطمة وسُجى، اللتين جسّدتا تجربة تعكس الإرادة والطموح وتحدّي الصعاب،           
والبطلة المتألقة / نسرين نصيف، في عمل فني يسلط الضوء على قصص ملهمة من واقع الحياة.                
العرض من إخراج عادل أمين، وبمشاركة فريق عمل ضم:               
حسن عبد العزيز – هشام بلال – حمادة التنجيري – عمر نخلة – يحيى محمود،              
الذين بذلوا مجهودا كبيرا ظهر بوضوح في مستوى العرض وتنظيمه.              
كما شهد الحدث حضور عدد من الداعمين والشخصيات التي حرصت على مساندة التجربة وإبراز رسالتها المجتمعية.             
`,
      Date: '15/11/2025'
    },
    {
      image: 'assets/News/Meeting.png',
      Heading: ' لقاء مع أهالي منطقة فيصل والحرفيين',
      Summary: `
ضمن سلسلة اللقاءات الميدانية ، شارك الأستاذ/ أحمد غريب حسين – مرشح حزب الجبهة الوطنية عن المقعد الفردي (رقم 2 – رمز السيارة 🚗) 
في لقاء  مع أهالي منطقة فيصل والحرفيين.
لتبادل الحوار حول أهم القضايا والاحتياجات في الشارع 
السويسي، في أجواء مليئة بالحماس والدعم لمرشحهم القادر على تمثيلهم بأمانة.            
`,
      Date: '11/11/2025'
    },

  ];

}
