import { Component } from '@angular/core';

@Component({
  selector: 'app-events',
  standalone: false,
  templateUrl: './events.html',
  styleUrl: './events.css',
})
export class Events {

  News = [
    {
      image: 'assets/Events/Event2.png',
      Heading: 'دعــــــــوة عامـــــــــــــة ',
      Summary: `يتشرف المرشح احمد غريب حسين   امين عام حزب الجبهة الوطنية بالسويس 
والمرشح علي المقعد الفردي 
#رقمـــ٢    #رمزــــالسيارة 
بدعوة اهالينا  ومحبينا ومؤيدينا في محافظة السويس لحضور  المؤتمر الجماهيري الكبير 
 ومن المقرر أن يشهد المؤتمر حضورًا بارزًا لعدد من القيادات السياسية والحزبية، في مقدمتهم
  النائب احمد رسلان الامين المساعد وامين التنظيم 
والوزير طاهر ابو زيد امين الرياضه 
والنائب فايز ابو حرب امين القبائل العربية وال لواء أحمد سعد امين العضويه
 وعدد من الشخصيات العامة والرموز الوطنية بمركزيه الحزب 
  لدعم وتأييد احمد غريب  فردي 
🔹 رقم (2) – رمز السيارة 🚗           
`,
      Date: '15/11/2025',
      Location :'منطقه ابو الحسن - ميدان المثلث – خلف مدرسه صلاح سالم'
    },

  ];

}
